---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachedParam
source: html/8c17dccd-30fb-bcad-53fc-600da5e9c7b4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ColumnTopAttachedParam Property

"Top is Attached"

## Syntax (C#)
```csharp
public static ForgeTypeId ColumnTopAttachedParam { get; }
```